package com.javarush.test.level12.lesson04.task03;

/* Пять методов print с разными параметрами
Написать пять методов print с разными параметрами.
*/

public class Solution
{
    public static void main(String[] args)
    {

    }
    public int print(int a){

        return a;
    }
    public int print(int a, int b){

        return a+b;
    }
    public void print(){
        System.out.println();
        return;
    }
    public String print(String a){

        return a;
    }
    public float print(float a){

        return a;
    }


    //Напишите тут ваши методы
}
